---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TooShortCurveDowngradeGeometry
source: html/2170cc6f-038f-ff9f-7837-0c3e4784bedf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TooShortCurveDowngradeGeometry Property

Curve is too short and may downgrade the geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooShortCurveDowngradeGeometry { get; }
```